Muckety is a website that provides information about the connections between people and organizations. It was founded in 2007 by journalists with years of experience at the Detroit Free Press, The New York Times and the Dallas Morning News. The site, which is free, is designed to be useful to reporters, as well as the general public.

Muckety uses public documents, official web sites, news coverage and other reliable sources to build its database. Users are able to query the online database and view these connections in interactive maps.

Muckety maps are interactive. To start exploring a map you need to click inside of the map area to activate it. Lines between items in the map show relationships - solid lines indicate current relations and dotted lines indicate former relations. If you move your mouse over a line a small box appears showing the nature of the relationship.

Muckety maps are color coded; people are orange and non-people are green. You can re-center the map on another item by holding down the control key and clicking on an item.

After clicking around in a map several times the maps can become quite crowded and complex. You can reset the map to its original state by clicking the Reset Map button in the top right corner of the map.

You can also perform a new search from within a map. Enter a search term in the box that says “Search Muckety” and press the Go button to start a new search.

Muckety is a valuable tool for journalists and anyone who wants to understand the power structures that shape our world. It is a powerful way to explore the connections between people and organizations, and to see how these connections are changing over time.

Here are some examples of how Muckety can be used:

* Journalists can use Muckety to research potential sources for stories. For example, if a journalist is working on a story about the influence of money in politics, they could use Muckety to find out who the major donors are to political campaigns.
* Researchers can use Muckety to study the networks of power and influence in a particular field or industry. For example, a researcher who is studying the pharmaceutical industry could use Muckety to map the relationships between pharmaceutical companies, doctors, and government regulators.
* Students can use Muckety to learn about the history of a particular event or issue. For example, a student who is studying the Watergate scandal could use Muckety to map the relationships between the key players in the scandal.

Muckety is a powerful tool that can be used for a variety of purposes. It is a valuable resource for journalists, researchers, and students.
