Sure, here is a JSON object based on the contents of the text:

```json
{
  "id": 3771,
  "authors": [
    {
      "name": "Brad Guilmino",
      "email": "bguilmino@hntb.com",
      "affiliation": "HNTB"
    }
  ],
  "conference": "IRE",
  "year": "2023",
  "title": "Tolling and Project Development",
  "description": "Tolling is an old art that is regaining popularity. In the U.S., motor fuel taxes are declining and aren't sustainable, and the highway system has matured, so the need for repairs has escalated. Many states are turning to tolling as an alternative funding source. Technology advancements have made tolling more user friendly, and tolling is gaining acceptance as a new revenue source, traffic management tool, and managed lanes tool. The tolling and project development process includes preliminary feasibility, initial project screening, sketch level, high-level screening, environmental permitting and approval, procurement award, preliminary design, consultant team, P3 conceptual feasibility, RFP, RFQ, financing, investment grade T&R, construction, and public project delivery decision. Financial feasibility is calculated by dividing net financing capacity by capital costs. T&R forecasts should be conservative and reliable, and key considerations for a credible study include realistic tolls, calculation of a user's willingness to pay, appropriate estimate of ramp-up duration, impact of potential recession/economic downturn, limited reliance on future land use forecasts, and complexity of the transaction. Toll road financing goals include maximizing the amount of debt, structuring a toll project financing, shaping debt around project cash flows, issuing debt as toll revenue bonds, utilizing multiple debt products, and structuring with "coverage". There are two main types of P3 delivery (DBFOM): concession and availability payment transaction. Sources of information include municipal bond disclosures, public owner self-reporting, and public meetings.",
  "keywords": ["tolling", "project development", "IRE", "2023"]
}
```
