The Louisiana Public Records Law is a law that requires public bodies in Louisiana to make their records available to the public. The law defines a public body as any branch, department, office, agency, board, commission, district, governing authority, political subdivision, or any committee, subcommittee, advisory board, or task force thereof, or any other instrumentality of state, parish, or municipal government, including a public or quasi-public nonprofit corporation designated as an entity to perform a governmental or proprietary function, or an affiliate of a housing authority.

The law also defines a public record as any book, record, writing, account, letter and letter books, maps, drawings, photographs, cards, tapes, recordings, memoranda, and papers, and all copies, duplicates, photographs, including microfilm, or other reproductions thereof, or any other documentary materials, regardless of physical form or characteristics, including information contained in electronic data processing equipment, having been used, being in use, or prepared, possessed, or retained for use in the conduct, transaction, or performance of any business, transaction, work, duty, or function which was conducted, transacted, or performed by or under the authority of the constitution or laws of this state, or by or under the authority of any ordinance, regulation, mandate, or order of any public body or concerning the receipt or payment of any money received or paid by or under the authority of the constitution or the laws of this state, except as otherwise provided in this Chapter or the Constitution of Louisiana.

The law requires public bodies to make their records available to the public upon request, unless the records are exempt from disclosure under one of the law's exemptions. The exemptions include records that are confidential by law, records that are prepared for litigation, and records that are trade secrets.

The law also requires public bodies to establish a public records policy and to designate a public records officer. The public records policy must describe how the public body will respond to public records requests and must include a list of the public body's records that are exempt from disclosure. The public records officer is responsible for responding to public records requests and for ensuring that the public body complies with the law.

The Louisiana Public Records Law is an important tool for ensuring transparency and accountability in government. The law gives the public the right to access information about how their government is operating and to hold their elected officials accountable.
