Public records are documents that are created, received, maintained, or used by a government agency, and that are required by law to be open to the public. Public records can include a wide variety of documents, such as:

* Meeting minutes
* Budgets
* Contracts
* Correspondence
* Reports
* Maps
* Photographs
* Videos

Public records are important because they allow citizens to hold their government accountable. By being able to access public records, citizens can learn about the decisions that their government is making, and they can see how their tax dollars are being spent. Public records can also be used to research historical events, to investigate government wrongdoing, and to promote transparency and accountability in government.

In Louisiana, the right to access public records is guaranteed by the state constitution. Article XII, Section 3 of the Louisiana Constitution states that "No person shall be denied the right to inspect public documents, except in cases established by law." This means that, with a few exceptions, any person has the right to inspect any public record that is created, received, maintained, or used by a government agency.

The Louisiana Public Records Law, Title 44 of the Louisiana Revised Statutes, sets forth the procedures for requesting and accessing public records. Under the Public Records Law, a person who wants to inspect a public record must make a written request to the custodian of the record. The custodian of the record must then make the record available for inspection within three business days. If the custodian refuses to make the record available, the person may file a lawsuit in court to compel disclosure.

There are a few exceptions to the right to access public records. For example, the Public Records Law does not require the disclosure of records that are confidential or that would invade the privacy of an individual. Additionally, the Public Records Law does not require the disclosure of records that are related to pending criminal investigations.

If you are interested in requesting public records from a government agency in Louisiana, you can find more information on the Louisiana Attorney General's website.
