I have provided the first section of the City of Fort Collins, Colorado General Records Retention Schedule. The schedule is divided into sections to facilitate updates and use. Records series are identified with the section number and a sequential item number (example 11.90). Record titles and description are included to facilitate identification of records. Retention of record copy and duplicate copies is also included. Retention periods are based on legal requirements for those records governed by such legal requirements and/or on common usage and industry standards for retention of City records to meet typical administrative, operational or reference requirements.

The retention time period indicates the minimum length of time that the record copy should be retained by the City before disposal can take place. A retention period is always specified for the record copy and may also be specified in some cases for duplicate copies for records that are widely distributed throughout an organization. If no retention period is specified for duplicate copies of a particular type of record, the City may dispose of these duplicates in accordance with the following guidelines:

* DUPLICATE COPIES CREATED FOR ADMINISTRATIVE OR CONVENIENCE PURPOSES
* Retain until no longer needed for reference and then destroy
* DUPLICATE COPIES OF FREQUENTLY UPDATED DOCUMENTS
* Retain until revised version is received, then destroy superceded version
* DUPLICATE COPIES CREATED FOR PRESERVATION PURPOSES
* Retain until preservation need ends

In most cases, duplicate copies should not be retained longer than the record copy.

Default Retention Period for Records Mandated by State Law
CRS 6-17-104 provides a default retention period of three years for records that state law requires to be retained when no retention period is otherwise specified in the law.

Retention Schedule Applies Regardless of Storage Format
The retention period specified in these schedules applies to the information contained within the record copy of the record, regardless of the physical format of the record (paper, microfilm, computer disk or tape, optical disk, etc.).

Litigation Hold on Destruction of Records
Records that may be pertinent to any possible claim or litigation may not be destroyed even if the record is eligible for destruction under the records retention schedule and even if the record should have been previously destroyed and was not. Consult with the City Attorney’s Office if there is any question regarding the destruction of records involving possible legal actions.

Important: No record should be destroyed if it is pertinent to any anticipated, pending or ongoing litigation, claim or other legal proceeding.

Non-Records
Guidelines for identification and handling of some non-records are discussed in Appendix A – Non-Records. There are no retention requirements for non-records, and non-records may be destroyed at will.

Retention Guidelines: Microfilming and Imaging
This retention schedule does not provide legal authority for the destruction of originals of records after microfilming or imaging. If departments wish to microfilm and/or image records and then destroy the originals, specific authorization for this action must be received from the Colorado State Archives.
