Pro Se Power! Acquiring Public Records by Filing Suit

Investigative Reporters & Editors

Phoenix, Arizona

June 24, 2017

David Cuillier and Jorge Rojas*

* David Cuillier, Ph.D., is director of the University of Arizona School of Journalism, where he researches and teaches access to public records, and is a member of the Society of Professional Journalists Freedom of Information Committee. He has been a newsroom trainer for SPJ since 2005, former president of SPJ, and served five years as SPJ’s FOI chair. He is co-author with Charles Davis of “The Art of Access: Strategies for Acquiring Public Records,” and is a member of the National Freedom of Information Coalition board. Before entering academia, he was a newspaper reporter and editor in the Pacific Northwest.

Jorge Rojas graduated in 2017 as an air traffic control major at Arizona State University. As a student, Jorge sued the Federal Aviation Administration five times to acquire hundreds of public records regarding the policies and practice of licensing of air traffic controllers. He learned everything on his own and was victorious, while going to school full-time and working as a campus lab assistant.

Acknowledgements: Thanks to many for input and advice on these materials, including Daxton “Chip” Stewart, J.D., Ph.D., associate professor and associate dean at Texas Christian University, Derek Bambauer, professor at the University of Arizona School of Law, and Robert Becker, a former journalist who practices law in Washington, D.C., and served as staff attorney for the Reporters Committee for Freedom of the Press 1982-1991.

Important disclaimer: Cuillier and Rojas are not licensed attorneys and cannot give legal advice. Cuillier is an educator/researcher and provides information about accessing public information, but cannot advise you on your legal case. If you wish to secure legal advice, please contact an attorney or reach out to the resources listed at the end of these tip sheets.

You Can Do It!

Time and time again we have seen journalists – or journalism organizations – denied public record requests and left with no recourse other than to sue. Yet, how many journalists – or journalism organizations – have the resources or gumption to file a lawsuit? Unfortunately, very few, and research shows fewer news organizations are willing to sue. The intimidation factor itself is the largest barrier, and a lot of government agencies know that, following the unwritten policy of only releasing sensitive records when a suit is actually filed. You can stand up to that. Sometimes simply filing a lawsuit will dislodge the records, and at minimum it makes for a good news peg to expose unnecessary government secrecy. This handout will walk you through the pro se (pronounced “pro say”) process of suing on your own, and where you can get the resources to cover your costs. You can do it!

Using This Guide

As mentioned on the first page, this is not to be considered legal advice, rather a starting point to educate you about the process of suing for public records. If you need legal advice, reach out to the resources listed at the end of this document. A lot of this information is focused on federal FOIA, but the same principles apply for suing a city or state agency under state public records laws. While the process might seem daunting at first, it’s not rocket science. Here are overall thoughts for starting out:

• Realize this will be a long battle, but DON’T GIVE UP! A typical FOIA case can last
a year, or longer, especially if the government intends to litigate, but don’t let this scare
you away. It might not serve your initial daily story, but it will help you get records in the
future, and send a message to agencies throughout your community that they can’t get
away with gaming the system when you request records.

• Don’t take things personally. What the attorneys write in their motions is part of their
job. Don’t take their attacks personally and you will do a better job at defeating them.

• Realize you won’t win every time. Realize that there are indeed some legal exemptions
which might actually apply to the records sought. Focus on your strong elements. Be
willing to seek help, or even cut bait if you have to. Don’t set bad precedent. Live to fight
another day!

Before Suing

Make sure you crossed your t’s and dotted your i’s when it comes to the initial public
records request. It is better to fix any procedural errors that you made prior to suing than
worrying about having the government move to dismiss the lawsuit after you filed.

•

Learn the law
o Read resources that explain the public records law. For federal FOIA, the
Reporters Committee for
