Open Government Guide

Arizona

Open Government Guide
Open Records and Meetings Laws in

ARIZONA
Sixth Edition
2011

The Reporters Committee for Freedom of the Press

i

The Reporters Committee for Freedom of the Press

The Reporters Committee for Freedom of the Press is a non-profit organization that works to protect the First Amendment and ensure that the public has access to information about government and the workings of democracy. The Reporters Committee provides legal representation to journalists and news organizations, conducts research on First Amendment issues, and advocates for open government laws.

The Reporters Committee was founded in 1970 by a group of journalists who were concerned about the growing number of court decisions that were limiting the press’s ability to gather and report the news. The Reporters Committee has since become one of the leading advocates for open government in the United States.

The Reporters Committee provides a variety of resources to journalists and news organizations, including legal assistance, training programs, and a library of information on First Amendment law. The Reporters Committee also publishes a number of publications, including the Reporters Committee Handbook on Open Government Law, which is the most comprehensive resource available on open government laws in the United States.

The Reporters Committee is committed to protecting the First Amendment and ensuring that the public has access to information about government and the workings of democracy. The Reporters Committee believes that an informed public is essential to a healthy democracy, and that open government laws are essential to an informed public.

ii

The Reporters Committee for Freedom of the Press

Introductory Note

The Reporters Committee for Freedom of the Press is pleased to publish the sixth edition of its Open Government Guide: Access to Public Records and Meetings in Arizona. This guide provides an overview of the open government laws in Arizona, including the Arizona Public Records Law and the Arizona Open Meetings Law.

The Arizona Public Records Law, A.R.S. § 39-121 et seq., requires all public bodies in Arizona to make their records available to the public upon request. The law defines a public record as “any writing or record, regardless of physical form or characteristics, made or received by any public body in the course of its official business.” The law also includes a number of exemptions from disclosure, such as records that are confidential by law or that would invade someone’s privacy.

The Arizona Open Meetings Law, A.R.S. § 38-431 et seq., requires all public bodies in Arizona to conduct their meetings in public. The law defines a public meeting as “any meeting of a public body at which official action is taken or is proposed to be taken.” The law also includes a number of exemptions from the open meetings requirement, such as meetings that are held to discuss personnel matters or to discuss litigation.

This guide provides an overview of the open government laws in Arizona, but it is not a substitute for legal advice. If you have any questions about the open government laws in Arizona, you should consult with an attorney.

iii

The Reporters Committee for Freedom of the Press

User’s Guide

This guide is designed to be a user-friendly resource for anyone who wants to learn about the open government laws in Arizona. The guide is divided into the following sections:

* Introductory Note
* Open Records
* Open Meetings
* Appendices

The Introductory Note provides an overview of the open government laws in Arizona.

The Open Records section provides an overview of the Arizona Public Records Law, including the definition of a public record, the exemptions from disclosure, and the procedures for obtaining public records.

The Open Meetings section provides an overview of the Arizona Open Meetings Law, including the definition of a public meeting, the exemptions from the open meetings requirement, and the procedures for attending public meetings.

The Appendices include a list of public bodies in Arizona, a sample public records request form, and a sample open meetings notice form.

We hope that this guide will be helpful to you in understanding the open government laws in Arizona. If you have any questions about the guide or about the open government laws in Arizona, please contact the Reporters Committee for Freedom of the Press at (202) 466-4920.

iv

The Reporters Committee for Freedom of the Press

Foreword

The open government laws in Arizona are essential to a healthy democracy. These laws ensure that the public has access to information about government and the workings of democracy.

The Arizona Public Records Law, A.R.S. § 39-121 et seq., requires all public bodies in Arizona to make their records available to the public upon request. The law defines a public record as “any writing or record, regardless of physical form or characteristics, made or
