Sure, here is a JSON object based on the contents of the text:

```json
{
  "id": 5351,
  "authors": [
    {
      "name": "Charles Ornstein",
      "email": "charles.ornstein@propublica.org",
      "affiliation": "ProPublica"
    },
    {
      "name": "Ryann Grochowski Jones",
      "email": "ryann.jones@propublica.org",
      "affiliation": "ProPublica"
    }
  ],
  "conference": "NICAR",
  "year": "2018",
  "title": "Hands on with health data",
  "description": "This tipsheet can be found at http://bit.ly/nicaropioids. For our hands on class, we will be working with data sets released by the Centers for Medicare and Medicaid Services (CMS) and the Centers for Disease Control and Prevention (CDC). Medicare is the federal public health insurance program for the elderly and disabled. Medicaid is a state-federal public health insurance program for the poor. The CDC is the main U.S. agency dedicated to public health. The data for this session are available here: Part_D_Opioid_Geographic_Data.zip Medicare_Part_D_Opioid_Prescriber_Summary_File_… Also: https://www.cdc.gov/drugoverdose/maps/rxcounty2016.html and https://www.cdc.gov/drugoverdose/maps/rxcounty2015.html Please note: A tipsheet on opioid data can be found at www.bit.ly/opioid-data. Dataset #1: Part D Opioid Geographic Data This dataset can be downloaded at the link above or here: https://www.cms.gov/Research-Statistics-Data-and-Systems/Statistics-Trends-and-Reports/Medicare-Provider-Charge-Data/Downloads/Part_D_Opioid_Geographi... When you unzip the file, you will see an Excel spreadsheet. In it are worksheets for State, County and ZIP Code. This data represents 2013-2015 data from Medicare Part D, Medicare’s prescription drug program. As of March 2018, this is the most-recent data. The program covers billions of prescriptions to seniors and disabled people. We will use this data to work on sorting and filtering. Dataset #2: Medicare Part D Opioid Prescriber Summary File This dataset can be downloaded at the link above or here: https://data.cms.gov/Medicare-Part-D/Medicare-Part-D-Opioid-Prescriber-Summary-File-201/6i2k-7h8p This is a large file. When you download it, you can look up prescribing patterns of individual doctors in the Medicare Part D program. This data includes only 2015 data, but CMS publishes it for 2013 and 2014, as well. Once you have identified a state or ZIP code of interest in the first dataset, you can drill down into the data, looking for individual doctors, in this dataset. Again, we will be working on sorting and filtering. Dataset #3 and 4: CDC data on opioid prescribing rates This data covers 2015 and 2016. First, you will want to open up a new Excel workbook. Then, and this is very important, you will want to go to Column C, highlight it, right click, select format cells and select text. It will look like this: The reason you want to do this is that we will be pasting data into this column that we want to be ingested as text. If you do not do this step, it will come in as a number (and Excel will drop the leading zero.) Next, go to this website: https://www.cdc.gov/drugoverdose/maps/rxcounty2016.html Scroll below the map and highlight everything beginning with “County” until the bottom of the spreadsheet: Now, go back to Excel and paste this into your workbook. DO NOT PASTE IT NORMALLY. Rather, paste it special. And select text. You do this by clicking on the triangle under the paste button. Do not click the paste button and don’t use Control V. Your data will look pretty: At the bottom of the Excel workbook, title your sheet 2016. Now open another worksheet and do the same thing for the 2015 data. https://www.cdc.gov/drugoverdose/maps/rxcounty2015.html Remember to reformat column C.
