B.

Texas Open Meetings Act

The Texas Open Meetings Act (TOMA) requires that all meetings of a governmental body be open to the public. The Act defines a "meeting" as "the deliberations of a quorum of a public body regarding the public's business that are held in any place, including but not limited to a public building, private residence, or motor vehicle." TEX. GOV'T CODE ANN. ยง 551.002(a).

The Act does not apply to certain types of meetings, such as:

* Meetings of a court or grand jury;
* Meetings of a legislative body;
* Meetings of a governmental body that are held to discuss the hiring or firing of an employee;
* Meetings of a governmental body that are held to discuss the purchase or sale of real property;
* Meetings of a governmental body that are held to discuss the negotiation of a contract;
* Meetings of a governmental body that are held to discuss the settlement of a lawsuit.

If a governmental body meets in violation of TOMA, any person who attends the meeting may file a lawsuit to enjoin the meeting and to recover damages. TEX. GOV'T CODE ANN. ยง 551.014.

C.

Federal Freedom of Information Act

The Federal Freedom of Information Act (FOIA) requires that the federal government make certain records available to the public upon request. FOIA applies to all federal agencies, including executive departments, independent agencies, and quasi-governmental agencies.

FOIA does not apply to certain types of records, such as:

* Records that are classified for national security reasons;
* Records that are related to the internal personnel rules and practices of an agency;
* Records that are specifically exempted by law;
* Records that are trade secrets or commercial or financial information obtained from a person and privileged or confidential;
* Records that are inter-agency or intra-agency memorandums or letters that would not be available by law to a party other than an agency in litigation with the agency;
* Records that are personnel and medical files and similar files the disclosure of which would constitute a clearly unwarranted invasion of personal privacy;
* Records containing information that could be used to identify a confidential source, including a news source, unless the source has consented in writing to disclosure;
* Geological and geophysical information and data, including maps, concerning wells.

If an agency denies a FOIA request, the requester may file an appeal with the agency. If the agency upholds its denial, the requester may file a lawsuit in federal court.

D.

Conclusion

The Texas Public Information Act, the Texas Open Meetings Act, and the Federal Freedom of Information Act are important tools for journalists to access information about government. Journalists should be familiar with these laws and how to use them to obtain information.
