Yes, I believe that the notepad reporter -- who never reports on “statistics” -- needs to know some statistics.

Statistical thinking probably won’t win promotions or prizes. It will help reporters get more stories correct. The logic of statistical inference can help “writerly” reporters—as it’s helped researchers in other fields for 50 years. A few statistical concepts can be more helpful to qualitative reporters, than to quantitative reporters who work with statistics software and copious data.

For example, reporters should know about bias and variance. Bias is how far off your estimates are from the true value, on average. Variance is how much your estimates vary from one another. You want to get as close to the truth as possible, so you want to minimize bias and variance.

Reporters should also know about model thinking. This is the idea that you should have a theory about what you’re trying to explain, and then you should collect data to test your theory. If you don’t have a theory, you’re just wandering around in the data, and you’re more likely to find spurious correlations.

Reporters should also know about omitted variables. This is the idea that if you don’t measure all of the variables that might affect your outcome, you might get a biased estimate of the effect of the variables you do measure. For example, if you’re trying to figure out whether a new drug is effective, you need to make sure that you measure all of the other factors that might affect whether people get better, such as their age, their health status, and their treatment regimen.

Reporters should also know about selection bias. This is the idea that if you don’t choose your sample randomly, you might get a biased estimate of the population. For example, if you’re trying to figure out how people feel about a new law, you might only survey people who are willing to talk to you, and those people might not be representative of the population as a whole.

Finally, reporters should know about how to collect good data. This includes things like making sure that your questions are clear and unambiguous, that your data collection methods are reliable, and that you have enough data to make your conclusions statistically significant.

All of these statistical concepts can help reporters get better stories. They can help reporters avoid making mistakes, and they can help reporters make more persuasive arguments.
