Sure, here is a JSON object based on the contents of the text:

```json
{
  "id": "T1733",
  "authors": [
    {
      "name": "Robert Cribb",
      "email": "robert.cribb@theglobeandmail.com",
      "affiliation": "The Globe and Mail"
    }
  ],
  "conference": "CAJ-IRE Conference",
  "year": "2002",
  "title": "FOI IN CANADA",
  "description": "Officially, Canadians subscribe to the notion that governments should be accountable to the public. There is no shortage of political rhetoric about the importance of openness and transparency in a democratic system. And we do have federal and provincial acts protecting a citizen's right to access information in the public interest. But there are growing concerns about the accessibility of public information in Canada, especially among journalists. Canadians do not read, see or hear the kinds of Freedom of Information (FOI) stories that fill American newspapers and news reports, largely because Canadian journalists can't get access to the kinds of information that is routinely available in the U.S. And many fear the regulatory regime is getting more restrictive every day. A good deal of public information in Canada is locked in government file cabinets, tightly guarded by eagle-eyed bureaucrats. Often, it takes months to access information which should be provided within 30 days. And even when the struggle to get information is successful, Canadian journalists are increasingly being billed thousands of dollars for access. A Queen's University study on access to information in Canada concluded that federal departments' handling of access have "changed significantly over the last five years. Federal institutions take longer to process requests and are less likely to release information. Expanding the black hole of public information is a growing number of public-private agencies that are not covered by access legislation. They include: [Nuclear] Waste Management Organization The Canadian Foundation for Innovation The Canadian Millennium Scholarship Foundation Genome Canada Canadian Blood Services Nav Canada The Greater Toronto Airport Authority and other major airport authorities The Canada Pension Plan Investment Board The Canadian Foundation for Climate and Atmospheric Sciences The St. Lawrence Seaway Management Corporation Canada Health Infoway Inc.",
  "keywords": ["FOI", "Canada", "journalism", "access to information"]
}
```
