Here are some ideas for investigative reporters:

* Medical Malpractice: How many doctors in your state have multiple payouts but have never been disciplined? Who in your state is lobbying for caps on non-economic damages – and how are they paying for it? What impact would caps have on lawyers’ ability to take malpractice cases? What impact would caps have on the number of lawsuits and insurance rates for doctors?

* Health: Who are the doctors in your state who have been disciplined for serious offenses but are still practicing? How effective is your state medical board? How are drug companies promoting their products to doctors and patients in your area? What dangerous drugs are still on the market? How can people in your area get affordable prescriptions? What is the federal government doing on these issues and how will it impact people in your area?

* Electricity Deregulation: What deregulation schemes are under consideration in your area? What type of corporate citizens are your local utilities?

* Auto Safety: What are the safety performance records of local carriers – both for cargo and for passengers? What types of crashes occur on roads in your area? New truck safety and licensing regulations will be going into effect soon regarding hazardous materials transport, hours-of-service and more. How effective are the rules? How will they affect safety and security in your area? What hazardous materials are carried in your state? Are hazardous or nuclear materials permitted to be transported through densely populated areas? Have there been major crashes or spills? How prepared are local emergency responders?

* Food: The U.S. Department of Agriculture recently okayed the purchase of irradiated meat for school lunch programs across the country. Now, individual school districts must decide whether to purchase the potentially harmful food that is severely understudied. Public Citizen’s experts say it’s a bad idea to serve irradiated beef to school children. Ask local school administrators and boards if they will choose the beef for school lunches, and talk to parents who are often ill-informed about what their children will be eating at school.

* Global Trade: What impacts are global and regional trade agreements having on your local laws? On your local economy? Why are local groups objecting to globalization?

* Campaign Finance: Shadowy “527” groups (named for their IRS code) are non-profit political organizations that can accept unlimited “soft money” contributions from unions, corporations and wealthy individuals for federal campaigning activities, including running “issue ads.” These groups must register with the IRS, not the more transparent Federal Election Commission. They are becoming the latest loophole for donors to exploit under the new McCain-Feingold campaign finance reform law, and are a way for political organizations to conceal their financial activity. Because disclosure rules are complex, many 527s are shrouded in secrecy.

* What are the 527s in your area? Who is giving to your elected representatives? What influence is that having on policies?

I hope this helps!
