```json
{
  "id": "T2066",
  "authors": [
    {
      "name": "Matt Carroll",
      "email": "mcarroll@globe.com",
      "affiliation": "Boston Globe"
    }
  ],
  "conference": "IRE",
  "year": "2004",
  "title": "Organizing a multi-zone investigative project",
  "description": "The Boston Globe reported on Friday, April 23, that the city of Boston had paid $12.6 million to 800 retiring teachers and municipal workers for unused sick time. For some long-time retirees, the checks from the little-known practice approached $100,000 and paid for cozy additions to summer cottages. It didn’t stop there. Across Greater Boston, 159 communities paid nearly $30 million to retirees in “sicktime buybacks,” as they are known. Ric Kahn’s story was the first in a long-planned “zoned” attack on the entrenched practice. That Sunday, the Globe’s five regional editions each carried separate stories about buybacks. A different reporter reported and wrote each zoned story, while charts detailed the extent of the practice in each community – five charts for five zoned editions, covering 159 communities. The stories generated a number of follows, which brought home to Globe readers how a practice that had started 30 or 40 years earlier with the best of intentions had, in many communities, morphed out of control until it had become a serious budget liability at a time when communities across the state were struggling with serious financial shortfalls. The story was a major success from the point of the “zones” and similar zone-wide projects are planned. Here’s a primer on how we did it. Start with a good idea that can be applied across all zones. In this case, the series evolved out of a story I wrote for the South zone about buybacks for municipal officials. The money paid out to municipal workers was decent, but except for a few individuals, not particularly eye-popping. But an elected official said I had missed the real story: money paid out to retiring school employees dwarfed the amount paid to municipal workers. A few phone calls later I knew the tipster was correct. I suggested to Mark Pothier, the South editor, and Dave Beard, the editor for the zones, that this might be a story with regional impact and they bought into it. One reporter or many? The first question was whether one reporter should do the story, or whether different reporters from each zone should handle their own stories. The decision was to have a different reporter in each zone write, since there were so many communities involved. Send out a FOIA that has a sharp, limited focus: The other reporters benefited from mistakes I had made with the first buyback story. My FOIA had eight or nine questions, covering a wide variety of topics. I was fishing, frankly, and that was a mistake. The zone has 48 communities, from big cities to sleepy farm towns, and many town officials were slow to respond. They complained that answering the wide-ranging questions was too time consuming. I learned from that. The FOIAs sent out by the other reporters were short and to the point. They asked two basic questions: 1.) What are the names and titles of school and municipal employees who retired in fy03? 2.) How much was each of those employees paid in sicktime buybacks? It took several weeks to get the bulk of the FOIA responses, then a few more weeks of nagging stragglers. If in real estate it’s “location, location, location!,” then with a multiregion investigation it’s “organize, organize, organize!” The biggest problem with a multi-community story is staying on top of all the information. Theresa Sanchez, the zone intern, was assigned the unglamorous if essential job of tracking the FOIA responses as they came in by e-mail and fax. She assembled the hard copy in a three-ring binder. We both entered the information into a spreadsheet, double and triple checking as we progressed. (I had recommended that the other zone reporters use Excel. Three of the four did; the fourth soon wished she had.) The spreadsheet was simplicity itself and since the other reporters had little or no Excel experience, it was a good first experience. Maximize impact: A decision had been made to run a page 1 story in the main sheet, and tease the zone stories. The zone stories would be in the Sunday editions, the largest circulation day. But when to run the main story? This was a surprisingly complicated problem. Ideally, everyone wanted Ric’s story to run on Sunday, too. But what if a major story broke in Iraq and Ric’s story was bumped? The
