Watchdog Reporting <> Page 10

. . . . AND THE MONEY GOES OUT
The budget and financial statements. A budget tells you what an organization expects to spend in the coming year. Financial statements tell you what it actually spent. Compare the two to see if the organization is on track. Look for big changes in spending, or for spending that doesn't seem to make sense.

Expense reports. Employees fill out expense reports to get reimbursed for their travel, meals and other expenses. These reports can be a gold mine for reporters. They can show you where employees are going, who they're meeting with, and what they're spending money on.

Contracts. Organizations often hire contractors to do work that they don't have the staff or expertise to do themselves. Contracts can be a great way to find out who's getting paid by the organization, and how much they're being paid.

Subsidies and grants. Organizations often receive money from the government or other sources. These subsidies and grants can be a great way to find out who's getting money from the organization, and how that money is being spent.

Lobbying and campaign contributions. Organizations often lobby the government and contribute to political campaigns. These activities can be a great way to find out who's trying to influence the organization, and how much money they're spending to do it.

Watchdog Reporting <> Page 11

Conclusion

Watchdog reporting is a vital part of a free and democratic society. It helps to ensure that government and other powerful institutions are accountable to the people. Watchdog reporters must be persistent, skeptical and willing to challenge the conventional wisdom. They must also be able to communicate their findings in a clear and concise way.

If you are interested in becoming a watchdog reporter, there are a few things you can do to prepare. First, read as much as you can about the subject you want to cover. Second, talk to other reporters who cover the same beat. Third, get involved in your community and learn about the issues that matter to people. Finally, don't be afraid to ask tough questions and hold people accountable.
