The development of journalist's privilege in the United States has been a long and winding road. From the early days of the Republic, journalists have fought to protect their sources from government scrutiny. However, it wasn't until the 1970s that the Supreme Court recognized a First Amendment right to protect confidential sources.

The first major case involving journalist's privilege was Branzburg v. Hayes, decided by the Supreme Court in 1972. In that case, three reporters were subpoenaed to testify before grand juries investigating criminal activity. The reporters refused to testify, arguing that doing so would violate their First Amendment rights.

The Supreme Court rejected the reporters' argument, holding that there is no First Amendment right to refuse to testify before a grand jury. However, the Court did recognize that there may be some circumstances in which a journalist's privilege could apply. The Court said that a journalist's privilege would only apply if the government could not obtain the information from any other source and if the information was essential to the government's case.

The Branzburg decision was a major setback for journalists, but it did not end the fight for journalist's privilege. In the years since Branzburg, many states have enacted shield laws that protect journalists from being compelled to reveal their sources. In addition, the Supreme Court has revisited the issue of journalist's privilege in several cases, and it has gradually expanded the scope of the privilege.

In the 1980 case of Zurcher v. Stanford Daily, the Supreme Court held that the government could search a newsroom without a warrant if there was probable cause to believe that evidence of a crime was present. However, the Court also said that the government must take steps to minimize the intrusion on the newsroom and to protect the confidentiality of journalists' sources.

In the 1991 case of Cohen v. Cowles Media Co., the Supreme Court held that a journalist could be sued for defamation if he or she knowingly published false information about a public figure. However, the Court also said that a journalist could not be sued for defamation if he or she had a good faith belief in the accuracy of the information and if the information was obtained from a confidential source.

The Supreme Court's decisions in Branzburg, Zurcher, and Cohen have helped to define the scope of journalist's privilege in the United States. However, the issue is still evolving, and it is likely that the Court will revisit the issue in the future.
